app/controllers/selections_controller.rb

SELECT  "selections".* FROM "selections" WHERE "selections"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @selection = Selection.find(params[:id])

INSERT INTO "selections" ("user", "size", "kid_friendly", "pet_friendly", "grooming", "trainability", "space", "activity_level", "need_for_attention") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"  [["user", "nick"], ["size", 4], ["kid_friendly", 1], ["pet_friendly", 1], ["grooming", 4], ["trainability", 1], ["space", 4], ["activity_level", 2], ["need_for_attention", 2]]
---
  def create
      @selection = Selection.new(selection_params)
       if @selection.save